import React from "react";
import { Stack, Typography } from "@mui/material";

export default function PrivacyPolicy() {
  return (
    <Stack
      sx={{
        width: "1200px",
        height: "content-fit",
        gap: "40px",
        margin: "auto",
        marginTop: "75px",
        marginBottom: "100px",
        // border: "solid",
      }}
    >
      <Stack direction="row" spacing={1}>
        <img src="/icon.png" width={23} height={23} />
        <Typography
          sx={{ fontSize: "22px", fontWeight: "700", color: "#272727" }}
        >
          Нууцлалын бодлого
        </Typography>
      </Stack>

      <Stack
        sx={{
          width: "full",
          height: "content-fit",
          fontSize: "18px",
          fontWeight: "400",
          lineHeight: "30px",
          color: "black",
        }}
      >
        {" "}
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
        албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
        үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
        вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
        дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
        /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
        хяналт тавина. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
        вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
        дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
        /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
        хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
        худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
        вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
        вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
        дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
        /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
        хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
        худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
        вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
        вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
        дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
        /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
        хяналт тавина. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
        вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
        дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
        /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
        хяналт тавина.
      </Stack>
    </Stack>
  );
}
